---
kind: enumMember
id: F:Autodesk.Revit.DB.ZoomFitType.FitToPage
enum: Autodesk.Revit.DB.ZoomFitType
source: html/9a2714db-3dc9-506a-e79e-9a4ad0d4b101.htm
---
# Autodesk.Revit.DB.ZoomFitType.FitToPage

Fit the whole view into a specific image size.